numbers_1=5
numbers_2=10
print(numbers_1 + numbers_2)
print(numbers_1 - numbers_2)
print(numbers_1 * numbers_2)
print(numbers_1/numbers_2)
#основные математическое операции
print(numbers_1**numbers_2)   #возведение в степень
print(numbers_1%numbers_2)    #остаток от деления
print(numbers_1//numbers_2)   #целочисленное деление
#Оператор "//" возвращает целочисленное деление двух чисел. Это означает, что результатом операции будет целое число, которое получается путем деления первого числа на второе, с отбрасыванием дробной части. Например, если numbers_1 = 10 и numbers_2 = 3, то результатом операции numbers_1//numbers_2 будет 3, так как при делении 10 на 3 получается 3 с остатком 1.
#математические операции
print(round(5.54, 1))    #округление до 1 цифры после запятой
print(round(5.5, 0))     #округление до большего числа (с запятой)
print(round(5.5))        #округление до большего числа (без запятой)
print(round(5.5,-1))     #округление до ближайшего большего числа кратное 10
print(round(5.5,-2))     #округление до ближайшего большего числа кратное 100
print(round(67.5,-2))    #округление до ближайшего большего числа кратное 100
#14 и 15 строчки одинаковы
#15,16,17,18 одинаковые строчки
#округление
