# Строки - Управляющие последовательности

#print("Строки - Управляющие последовательности\n" + "-" * 50)

# \n - перенос строки
# \t - табуляция
# \ - экранирование

#print('Список необходимых продуктов:\n\t1. Молоко "Вкусное молоко"\n\t2. Сыр "Вкусный сыр"\n\t3. Мясо "Вкусное мясо"')
print('Список необходимых продуктов:\n 1. Молоко Вкусное молоко\n 2. Сыр Вкусный сыр\n 3. Мясо Вкусное мясо')
print('Список необходимых продуктов:\n1. Молоко "Вкусное молоко"\n2. Сыр "Вкусный сыр"\n3. Мясо "Вкусное мясо"')