myName="Max"
myAge=22
height=2.55
is_build=True
print(bool(myName))
print(float(myAge))
print(int(height))
print(str(is_build))
#преобразования типов данных
#если с 2 и 3 строкой все ясно, то с 1 и 4 было не понятно
#В данном коде определены переменные: myName (строка "Max"), myAge (целое число 22), height (число с плавающей запятой 2.55) и is_build (логическое значение True).

#Затем код выводит результаты приведения к различным типам данных:

#bool(myName) - приведение строки myName к логическому типу. Любая непустая строка приводится к True, поэтому результат будет True.
#float(myAge) - приведение целого числа myAge к числу с плавающей запятой. Результатом будет число 22.0.
#int(height) - приведение числа с плавающей запятой height к целому числу. Целая часть числа 2.55 равна 2, поэтому результатом будет число 2.
#str(is_build) - приведение логического значения is_build к строке. Результатом будет строка "True".
#Таким образом, данный код демонстрирует приведение различных типов данных к другим типам в Python.